Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: If you want to use Docker to run a MongoDB database, you can use the following command to launch one:
zh_cn: 如果你想使用Docker来运行MongoDB数据库，你可以使用以下命令来启动一个数据库：

source: If you want to use RabbitMQ, you should use the xref:rabbitmq.adoc[SmallRye Reactive Messaging RabbitMQ extension]. Alternatively, if you want to use RabbitMQ with AMQP 1.0 you need to enable the AMQP 1.0 plugin in the RabbitMQ broker; check the https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[connecting to RabbitMQ] documentation.
zh_cn: 如果你想使用 RabbitMQ，你应该使用 xref:rabbitmq.adoc[SmallRye响应式消息RabbitMQ 扩展] 。另外，如果你想使用带有 AMQP 1.0的RabbitMQ ，你需要在 RabbitMQ 代理中启用 AMQP 1.0 插件；请查看 link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.9/amqp/amqp.html#amqp-rabbitmq[连接到 RabbitMQ] 文档。

source: If you want to use SSL/TLS encryption, you need to add these properties in your `application.properties`:
zh_cn: 如果你想使用SSL/TLS加密，你需要在你的 `application.properties` 中添加这些属性：

source: If you want to use a specific codec, you need to set it on both ends explicitly:
zh_cn: 如果你想使用一个特定的编解码器，你需要在两端明确地设置它：

source: If you want to use the AWS Gateway HTTP API, generate your project with this script:
zh_cn: 如果你想使用AWS Gateway HTTP API，请用这个脚本生成你的项目：

source: If you want to use the AWS Gateway REST API, generate your project with this script:
zh_cn: 如果你想使用AWS Gateway REST API，请用这个脚本生成你的项目：

source: If you want to use the legacy API, you need to add the following dependency to your build file:
zh_cn: 如果你想使用旧的API，你需要在你的构建文件中添加以下依赖：

source: If you work with JWT tokens only and expect that a matching `JsonWebKey` will always be available (possibly after a key set refresh) then you should disable the token introspection:
zh_cn: 如果你只使用JWT令牌，并且期望一个匹配的 `JsonWebKey` ，那么你应该禁用令牌自省：

source: If you work with Keycloak and configure `mp.jwt.verify.publickey.location` to point to HTTPS or HTTP based JsonWebKey (JWK) set then you can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing-keycloak[OpenID Connect Bearer Token Integration testing] Keycloak section but only change the `application.properties` to use MP JWT configuration properties instead:
zh_cn: 如果你使用Keycloak，并配置了 `mp.jwt.verify.publickey.location` ，以指向HTTPS或基于HTTP的JsonWebKey（JWK）集，那么你可以使用与 link:security-openid-connect.html#integration-testing-keycloak[OpenID Connect Bearer Token集成测试] `Keycloak` 部分中描述的方法，只是需改变 `application.properties` ，以使用MP JWT配置属性来代替：

source: If you work with Keycloak and observe the issuer verification errors due to the different host addresses then configure Keycloak with a `KEYCLOAK_FRONTEND_URL` property to ensure the same host address is used.
zh_cn: 如果你使用Keycloak，并观察到由于不同的主机地址导致发行人验证错误，那么用 `KEYCLOAK_FRONTEND_URL` 属性配置Keycloak，以确保使用相同的主机地址。

source: If you work with Quarkus extensions which do not support `HTTP` (for example, `Quarkus GRPC`) or provide their own extension specific `HTTP` support conflicting with the one offered by `quarkus-smallrye-jwt` and `Vert.x HTTP` (example, `Quarkus Amazon Lambda`) and you would like to <<jwt-parser, Parse and Verify JsonWebToken with JWTParser>> then please use `smallrye-jwt` directly instead of `quarkus-smallrye-jwt`.
zh_cn: 如果你使用的Quarkus扩展不支持 `HTTP` （例如： `Quarkus GRPC` ），或者他们自己的扩展使用了特定的 `HTTP` ，与 `quarkus-smallrye-jwt` 和 `Vert.x HTTP` 提供的支持相冲突（例如： `Quarkus Amazon Lambda` ），并且你想 link:#jwt-parser[用JWTParser解析和验证JsonWebToken] ，那么请直接使用 `smallrye-jwt` ，而不是 `quarkus-smallrye-jwt` 。

source: If you work with the opaque tokens then you can test them as follows:
zh_cn: 如果你用不透明的令牌，那么你可以按以下方式测试它们：

source: If you'd like to access a public resource without `quarkus-keycloak-authorization` trying to apply its policies to it then you need to create a `permit` HTTP Policy configuration in `application.properties` as documented in the xref:security-authorization.adoc[Security Authorization] guide.
zh_cn: 如果您想访问一个不受 `quarkus-keycloak-authorization` 授权策略影响的公共资源，那么您需要在 `application.properties` 中创建一个 `permit` HTTP策略配置，正如 link:security-authorization.html[安全授权] 指南中所记载的那样。

source: If you'd like to block access to the public resource to anonymous users then you can create an enforcing Keycloak Authorization Policy:
zh_cn: 如果您想阻止匿名用户访问公共资源，那么您可以创建一个强制的Keycloak授权策略：

source: If you'd like to consume records only written and committed inside a Kafka transaction you need to configure the `isolation.level` property on the incoming channel as such:
zh_cn: 如果您想使用仅在 Kafka 事务中写入和提交的记录，您需要在传入通道上配置 `isolation.level` 属性，如下所示：

source: If you'd like to skip the token verification when the public endpoint methods are invoked then please disable the xref:security-built-in-authentication.adoc#proactive-authentication[proactive authentication].
zh_cn: 如果你想在调用公共端点方法时跳过令牌验证，那么请停用 link:security-built-in-authentication.html#proactive-authentication[主动验证] 。

source: If you're using repositories, then you will want to extend `PanacheMongoRepositoryBase` instead of `PanacheMongoRepository` and specify your ID type as an extra type parameter:
zh_cn: 如果你使用存储库，那么你要继承 `PanacheMongoRepositoryBase` ，而不是 `PanacheMongoRepository` ，并指定你的ID类型作为一个额外的类型参数：

source: If you're using repositories, then you will want to extend `PanacheRepositoryBase` instead of `PanacheRepository` and specify your ID type as an extra type parameter:
zh_cn: 如果你使用Repository模式，那么要继承 `PanacheRepositoryBase` ，而非 `PanacheRepository` ，并将ID字段类型作为额外的类型参数：

source: If your Bearer tokens are in a JWT format, you can use either of the three extensions. Both `quarkus-oidc` and `quarkus-smallrye-jwt` support refreshing the JsonWebKey (JWK) set when the OpenID Connect provider rotates the keys. Therefore, if remote token introspection must be avoided or is unsupported by the providers, use `quarkus-oidc` or `quarkus-smallrye-jwt` for verifying JWT tokens.
zh_cn: 如果您有JWT格式的 Bearer tokens，那么这三个扩展都可以使用。 `quarkus-oidc` 和 `quarkus-smallrye-jwt` 都支持在OpenID Connect提供者旋转密钥时刷新JsonWebKey（JWK）集，因此，如果必须避免远程token自查或提供者不支持，则应使用 `quarkus-oidc` 或 `quarkus-smallrye-jwt` 来验证JWTtoken。

source: If your Bearer tokens must be verified, use `quarkus-oidc`, `quarkus-smallrye-jwt`, or `quarkus-elytron-security-oauth2`.
zh_cn: 当需要验证Bearer tokens时，您可以使用 `quarkus-oidc` , `quarkus-smallrye-jwt` 和 `quarkus-elytron-security-oauth2` 。

source: If your Kafka broker uses OAuth as authentication mechanism, you need to configure the Kafka consumer to enable this authentication process. First, add the following dependency to your application:
zh_cn: 如果您的Kafka broker使用OAuth作为认证机制，您需要配置Kafka消费者来启用这个认证过程。首先，在您的应用程序中添加以下依赖：

source: If your Quarkus Security architecture includes RESTEasy Reactive and Jackson, Quarkus can limit the fields that are included in JSON serialization based on the configured security. For more information, see xref:resteasy-reactive.adoc#secure-serialization[Writing REST services with RESTEasy Reactive].
zh_cn: 如果您的Quarkus Security架构包含RESTEasy Reactive和Jackson时，Quarkus可以根据配置的安全性限制包含在JSON序列化中的字段。详情请参见 link:resteasy-reactive.html#secure-serialization[RESTEasy Reactive文档] 。

source: If your `@Transactional`-annotated method returns a reactive value, such as:
zh_cn: 如果你的 `@Transactional` -注释的方法返回一个响应性的值，例如：

source: If your application contains classes annotated with `javax.enterprise.context.ApplicationScoped` for example, then `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` needs to be added as well. Same goes for any class that needs to have a dynamic proxy created at runtime.
zh_cn: 例如，如果您的应用程序包含了带有 `javax.enterprise.context.ApplicationScoped` 注解的类，那么也需要添加 `<option>all-open:annotation=javax.enterprise.context.ApplicationScoped</option>` 。任何需要在运行时创建动态代理的类也是如此。

source: If your application needs to accept the tokens with the encrypted claims or with the encrypted inner signed claims then all you have to do is to set `smallrye.jwt.decrypt.key.location` pointing to the decryption key.
zh_cn: 如果你的应用程序需要接受带有加密的声明(claim)或带有加密的内部签名声明的令牌，那么你所要做的就是设置 `smallrye.jwt.decrypt.key.location` ，指向解密密钥的位置。

source: If your class doesn't obey these rules (for example by including a method that starts with `get` but is not a setter), you could provide a custom codec for it. Your custom codec will be automatically discovered and registered inside the codec registry. See xref:mongodb.adoc#simplifying-mongodb-client-usage-using-bson-codec[Using BSON codec].
zh_cn: 如果你的类不遵守这些规则（例如，包括一个以 `get` 开始但不是setter的方法），你可以为它提供一个自定义的编解码器。你的自定义编解码器将被自动发现并在编解码器注册表内注册。参见 link:mongodb.html#simplifying-mongodb-client-usage-using-bson-codec[使用BSON编解码器] 。

source: If your class is in a third-party jar, you can do it by using an empty class that will host the `@RegisterForReflection` for it.
zh_cn: 如果你的类在第三方的jar中，你可以通过使用一个空的类来做，这个空的类将为它托管 `@RegisterForReflection` 。

source: If your code makes HTTPS calls, such as to a micro-service (or AWS service), you will need to add configuration to the native image, as GraalVM will only include the dependencies when explicitly declared. Quarkus, by default enables this functionality on extensions that implicitly require it. For further information, please consult the xref:native-and-ssl.adoc[Quarkus SSL guide]
zh_cn: 如果你的代码进行了HTTPS调用，如对微服务（或AWS服务）进行了调用，那么你将需要在原生镜像中添加配置，因为GraalVM只有在明确声明的情况下才会包含依赖项。Quarkus 默认会在隐含需要它的扩展上启用该功能。欲了解更多信息，请咨询 link:native-and-ssl.html[Quarkus SSL指南]

source: If your delete query does not start with `delete`, we support the following additional forms:
zh_cn: 如果你的删除语句不是以 `delete` 开始，我们还支持以下的形式：

source: If your method is annotated with `@Transactional`, it will be considered _blocking_ automatically, even if the method is not annotated with `@Blocking`.
zh_cn: 如果你的方法被注释为 `@Transactional` ，它将被自动视为 _blocking_ ，即使该方法没有被注释为 `@Blocking` 。

source: If your method returns a `Uni` or `CompletionStage`, you need to add the `@NonBlocking` annotation:
zh_cn: 如果您的方法返回一个 `Uni` 或 `CompletionStage` ，您需要添加 `@NonBlocking` 注解：

source: If your query does not start with `{`, we will consider it a PanacheQL query:
zh_cn: 如果你的查询不是以 `{` 开始，我们将认为它是一个PanacheQL查询：

source: If your select query does not start with `from`, we support the following additional forms:
zh_cn: 如果你的查询语句不是以 `from` 开始，我们还支持以下的形式：

source: If your update query does not start with `update`, we support the following additional forms:
zh_cn: 如果你的更新语句不是以 `update` 开始，我们还支持以下的形式：

source: Ignoring endpoints
zh_cn: 忽略节点

source: Imagine the following entity:
zh_cn: 想象一下下面这个实体：

source: Imagine we have a `Fruit` data class as follows:
zh_cn: 假设我们有一个 `Fruit` 数据类，如下所示：

source: Imperative
zh_cn: 指令式

source: Imperative and reactive code
zh_cn: 指令式和响应式代码

source: Imperative vs. Reactive: a question of threads
zh_cn: 指令式与响应式：线程的问题

source: Implementing GraphQL Services
zh_cn: 实施GraphQL服务

source: Implementing fire and forget interactions
zh_cn: 实现即发即弃（fire and forget）交互

source: Implementing gRPC Services
zh_cn: 实现gRPC服务

source: Import the {quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
zh_cn: 导入{quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[realm配置文件]来创建一个新realm。更多细节，请参阅Keycloak文档中关于如何 link:https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[创建一个新的realm] 。

source: Import the {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
zh_cn: 导入 {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[领域配置文件] 来创建一个新领域(realm)。更多细节，请参阅Keycloak文档中关于如何 https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[创建一个新的领域] 。

source: Important Gradle configuration points
zh_cn: Gradle配置要点

source: Important Maven configuration points
zh_cn: Maven配置要点

source: Important Technical Note
zh_cn: 重要技术说明

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
zh_cn: 通过实时编码改善和加快内循环开发过程，代码的变化会自动反映在你运行的应用程序中。 代码 -> 刷新浏览器 -> 重复

source: In *batch* mode, your application can receive all the records returned by the consumer *poll* in one go.
zh_cn: 在 *批量* 模式下，您的程序可以一次性接收消费者 *轮询* 返回的所有记录。

source: In JSON Web Key (JWK) format
zh_cn: 以JsonWebKey (JWK) 格式

source: In JVM mode, it will work out of the box. However, to compile your application to a native executable, you need to:
zh_cn: 在JVM模式下，它开箱即用。然而，如果要把您的应用程序编译成一个原生的可执行文件，您需要：

source: In Kafka, a consumer group is a set of consumers which cooperate to consume data from a topic. A topic is divided into a set of partitions. The partitions of a topic are assigned among the consumers in the group, effectively allowing to scale consumption throughput. Note that each partition is assigned to a single consumer from a group. However, a consumer can be assigned multiple partitions if the number of partitions is greater than the number of consumer in the group.
zh_cn: 在Kafka中，消费者组表示可以通过合作来消费来自于同一个topic的数据的一组消费者。 一个topic可以包含一组分区(partitions)。一个topic的分区会在组内的消费者之间分配，从而有效地提高消费的吞吐量。请注意，每个分区只会被分配给组内的一个消费者。但如果分区的数量大于组中消费者的数量， 那么一个消费者可以被分配多个分区。

source: In Quarkus, the default Jackson `ObjectMapper` obtained via CDI (and consumed by the Quarkus extensions) is configured to ignore unknown properties (by disabling the `DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES` feature).
zh_cn: 在Quarkus中，通过CDI获得的默认Jackson `ObjectMapper` （并由Quarkus扩展使用）被配置为忽略未知属性（通过禁用 `DeserializationFeature.FAIL_ON_UNKNOWN_PROPERTIES` 功能）。

source: In _experimental_ mode, early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
zh_cn: 在 _experimental(实验)_ 模式下，要求早期反馈以使想法成熟。在解决方案成熟之前，不保证稳定性或长期存在于平台中。欢迎在我们的 link:https://groups.google.com/d/forum/quarkus-dev[邮件列表] 中提供反馈，或在我们的 link:https://github.com/quarkusio/quarkus/issues[GitHub问题列表] 中提出问题。

source: In _preview_, backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require changing configuration or APIs, and plans to become _stable_ are under way. Feedback is welcome on our https://groups.google.com/d/forum/quarkus-dev[mailing list] or as issues in our https://github.com/quarkusio/quarkus/issues[GitHub issue tracker].
zh_cn: 在 _preview(预览)_ 中，不保证向后兼容和在生态系统中的存在。具体的改进可能需要改变配置或API，并且正在计划变得 _稳定_ 。欢迎在我们的 link:https://groups.google.com/d/forum/quarkus-dev[邮件列表] 中提供反馈，或在我们的 link:https://github.com/quarkusio/quarkus/issues[GitHub问题列表] 中提出问题。

source: In a Gradle project, you would find a similar setup:
zh_cn: 在Gradle项目中，你会发现一个类似的设置。

source: In a terminal, launch the application in dev mode using: `./mvnw quarkus:dev`. Quarkus automatically starts a database instance for you and configure the application. Now we only need to implement the HTTP endpoint.
zh_cn: 在终端中，使用：`./mvnw quarkus:dev`。Quarkus会自动为您启动一个数据库实例并配置应用程序。现在我们只需要实现HTTP端点。

source: In a terminal, navigate to the root of the project and run:
zh_cn: 在终端中，切换到项目根目录下 运行以下命令:

source: In addition to Vert.x core, you can use most Vert.x ecosystem libraries. Some Quarkus extension already wraps Vert.x libraries.
zh_cn: 除了Vert.x核心，你可以使用大多数Vert.x生态系统库。一些Quarkus扩展已经包装了Vert.x库。

source: In addition to the regular files, the build also produces `target/getting-started-1.0.0-SNAPSHOT-runner`. You can run it using: `./target/getting-started-1.0.0-SNAPSHOT-runner`.
zh_cn: 除了常规文件外，该构建还产生了 `target/getting-started-1.0.0-SNAPSHOT-runner` 。你可以用以下方式运行它： `./target/getting-started-1.0.0-SNAPSHOT-runner` 。

source: In addition to this default configuration, you can configure the name of the `Map` producer using the `kafka-configuration` attribute:
zh_cn: 除了这个默认配置外，您还可以使用 `kafka-configuration` 属性配置 `Map` 生产者的名称：

source: In addition to this you can also create your own test stereotypes. For example, we could create a `@TransactionalQuarkusTest` as follows:
zh_cn: 除此以外，您还可以创建您自己的测试 stereotypes。例如，我们可以创建一个 `@TransactionalQuarkusTest` ，如下所示：

source: In addition, IntelliJ IDEA has additional support for Quarkus in their Ultimate non-open source version.
zh_cn: 此外，IntelliJ IDEA在其闭源的Ultimate版本中对Quarkus有额外的支持。

source: In addition, remember to enable the AWS X-Ray tracing parameter in `manage.sh`, in the `cmd_create()` function. This can also be set in the AWS Management Console.
zh_cn: 此外，记得在 `manage.sh` ， `cmd_create()` 函数中启用AWS X-Ray追踪参数。这也可以在AWS管理控制台中进行设置。

source: In addition, the xref:tooling.adoc[tooling guide] document explains how to:
zh_cn: 此外，xref:tooling.adoc[工具指南] 文档解释了如何做到：

source: In another terminal, run `curl localhost:8080/count` to check the counter value. After a few seconds, re-run `curl localhost:8080/count` to verify the counter has been incremented.
zh_cn: 在另一个终端，运行 `curl localhost:8080/count` 检查计数器的值。几秒钟后，重新运行 `curl localhost:8080/count` ，以验证计数器已被递增。

source: In another terminal, run:
zh_cn: 在另外一个终端中，运行:

source: In case of in-memory channels, `@Broadcast` annotation can be used on the `@Outgoing` method. For example,
zh_cn: 在内存 channels 的情况下， `@Broadcast` 注释可以用在 `@Outgoing` 方法上。比如说,

source: In case you are interested in using the `Flyway` object directly, you can inject it as follows:
zh_cn: 如果你有兴趣直接使用 `Flyway` 对象，可以按以下方式注入。

source: In case you encounter the `org.bson.codecs.configuration.CodecConfigurationException` exception, it means the codec is not able to automatically convert your object. This codec obeys the Java Bean standard, so it will successfully convert a POJO using public fields or getters/setters. You can use `@BsonIgnore` to make a field, or a getter/setter, ignored by the codec.
zh_cn: 如果你遇到了 `org.bson.codecs.configuration.CodecConfigurationException` 异常，这意味着编解码器不能自动转换你的对象。这个编解码器遵守Java Bean的标准，所以它将成功地转换使用公共字段或getter/setters的POJO。你可以使用 `@BsonIgnore` ，使一个字段或一个getter/setter被编解码器所忽略。

source: In case you have any issues with serializer autodetection, you can switch it off completely by setting `quarkus.reactive-messaging.kafka.serializer-autodetection.enabled=false`. If you find you need to do this, please file a bug in the link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] so we can fix whatever problem you have.
zh_cn: 如果您对使用序列化器自动侦测有任何疑问，您可以通过设置 `quarkus.reactive-messaging.kafka.serializer-autodetection.enabled=false` 来彻底关闭它。如果您需要这样做，请在 link:https://github.com/quarkusio/quarkus/issues[Quarkus问题跟踪] 中提交一个bug，这样我们就能跟踪并解决您的任何问题。

source: In certain circumstances, you may want to build the native image in a separate step. For example, in a CI/CD pipeline, you may want to have one step to generate the source that will be used for the native image generation and another step to use these sources to actually build the native executable. For this use case, you can set the `quarkus.package.type=native-sources`. This will execute the java compilation as if you had started native compilation (`-Pnative`), but stops before triggering the actual call to GraalVM's `native-image`.
zh_cn: 在某些情况下，你可能想在独立的步骤中构建本地可执行文件。例如，在CI/CD pipeline中，你可能希望在独立步骤中生成用于原生可执行文件构建的源文件，另一个步骤才是使用这些源文件来构建原生可执行文件。对于这种情况，你可以设置 `quarkus.package.type=native-sources` 。这个属性会像原生编译一样（ `-Pnative` ）执行java编译，但不会触发调用GraalVM的 `native-image` 。

source: In certain circumstances, you may want to build the native image in a separate step. For example, in a CI/CD pipeline, you may want to have one step to generate the source that will be used for the native image generation and another step to use these sources to actually build the native executable. For this use case, you can set the `quarkus.package.type=native-sources`. This will execute the java compilation as if you would have started native compilation (`-Pnative`), but stops before triggering the actual call to GraalVM's `native-image`.
zh_cn: 在某些情况下，你可能想在一个单独的步骤中构建本地镜像。例如，在CI/CD管道中，你可能希望有一个步骤来生成用于原生镜像的源，另一个步骤是使用这些源来实际构建原生可执行文件。对于这种用例，你可以设置 `quarkus.package.type=native-sources` 。这将执行java编译，就像你已经开始原生编译一样（ `-Pnative` ），但在触发对GraalVM的 `native-image` 的实际调用之前停止。

source: In dev and test mode, Quarkus will start a mock AWS Lambda event server that will convert HTTP requests to the corresponding API Gateway event types and post them to the underlying Quarkus HTTP lambda environment for processing. This simulates the AWS Lambda environment as much as possible locally without requiring tools like Docker and SAM CLI.
zh_cn: 在开发和测试模式下，Quarkus会启动一个模拟的AWS Lambda事件服务器，该服务器将HTTP请求转换为相应的API Gateway事件类型，并将其发布到底层的Quarkus HTTP lambda环境进行处理。这尽可能在本地模拟AWS Lambda环境，而不需要Docker和SAM CLI等工具。

source: In dev mode Quarkus will automatically restart the application if any of the existing migration scripts get modified. If you want to take advantage of this while developing and testing new migration scripts, you will want to set `%dev.quarkus.flyway.clean-at-start=true`, so that Flyway actually runs the modified migration.
zh_cn: 如果任何当前迁移脚本被修改，Quarkus在开发模式下会自动重启应用。如果你想在开发测试新的迁移脚本的时候充分利用这个特性，你需要设置 `%dev.quarkus.flyway.clean-at-start=true` ，这样Flyway会运行被修改的迁移脚本。

source: In dev mode and when running tests, xref:amqp-dev-services.adoc[Dev Services for AMQP] automatically starts an AMQP broker.
zh_cn: 在开发模式下，当运行测试时，link:amqp-dev-services.html[AMQP的开发服务] 会自动启动一个AMQP代理。

source: In environments with read only file systems you may receive errors of the form:
zh_cn: 在具有只读文件系统的环境中，您可能会收到以下形式的错误：

source: In general, Vert.x verticles are not CDI beans. And so cannot use injection. However, in Quarkus, you can deploy verticles as beans. Note that in this case, CDI (Arc in Quarkus) is responsible for creating the instance.
zh_cn: 一般来说，Vert.x的verticles不是CDI beans。所以不能使用注入。然而，在Quarkus中，你可以把verticle部署为Bean。注意，在这种情况下，CDI（Quarkus中的Arc）负责创建实例。

source: In general, these properties are prefixed using `%prod` to enable them only when running in production mode.
zh_cn: 一般来说，这些属性的前缀使用 `%prod` ，以便只在生产模式下运行时启用。

source: In https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java] you can see how the test for the fruit application can be implemented.
zh_cn: 在 https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java]中，您可以看到如何实现水果应用程序的测试。

source: In native mode, Snappy is disabled by default as the use of Snappy requires embedding a native library and unpacking it when the application starts.
zh_cn: 在原生模式下，Snappy默认是禁用的，因为使用Snappy需要嵌入一个原生库，并在应用程序启动时对其进行解包。

source: In order to access the admin endpoint you should obtain a token for the `admin` user:
zh_cn: 为了访问管理节点，您需要获得一个 `admin` 用户的token：

source: In order to show a more practical example of Kotlin usage we will add a simple link:https://kotlinlang.org/docs/reference/data-classes.html[data class] called `Greeting.kt` like so:
zh_cn: 为了展示一个更实际的Kotlin使用例子，我们将像这样添加一个简单的 link:https://kotlinlang.org/docs/reference/data-classes.html[数据类] ，叫做 `Greeting.kt` ：

source: In other contexts, it is possible to have other parallel representations of the same information or parts of it, for example, `SecurityContext` for JAX-RS or `JsonWebToken` for JSON Web Tokens (JWT).
zh_cn: 在其他一些情况下，您可能有相同信息或部分相同信息的其他不同表示，如JAX-RS的 `SecurityContext` ，或JWT的 `JsonWebToken` 。
